Тестовая_база_ERP_14/src/Documents/АГ_ЗаявкаНаДобровольнуюСертификацию/АГ_ЗаявкаНаДобровольнуюСертификацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_ЗаявкаНаДобровольнуюСертификацию</name>
  <comment>АГ:[+][DOBS_001_2][29.05.2019 22:57][Коробков]</comment>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЗаявки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФайлаДанных</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификация</name>
    <attributes>
      <name>НоменклатураИзЗаказаПоставщика</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураДляСертификации</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаДляСертификации</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативнаяДокументация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрилагаемыеДокументы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВагонаТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПоСертификату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодлежитСертификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовогоСертификата</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНовогоСертификата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеДокументы</name>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>CatalogRef.АГ_ЗаявкаНаДобровольнуюСертификациюПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Documents/АГ_ЗаявкаНаДобровольнуюСертификацию/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПрикрепитьФайлДанных(Команда)

	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выбор файла";
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПрикрепитьФайлДанныхЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлДанныхЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
		
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		ВыбФайл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		Файл = Новый ДвоичныеДанные(ВыбФайл);
		Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
		
		ПрикрепитьФайлДанныхНаСервере(Адрес);
		
		ИмяФайла = Прав(ВыбФайл, СтрДлина(ВыбФайл) - СтрДлина(ДиалогОткрытияФайла.Каталог));	
		Объект.ФайлДанных = ИмяФайла;
		Объект.ДатаФайлаДанных = ТекущаяДата();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрикрепитьФайлДанныхНаСервере(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ХранилищеФайла = Новый ХранилищеЗначения(ДвоичныеДанные);
	ДокОбъект.Записать();	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлДанных(Команда)
	
	ФайлПолученный = ОткрытьФайлДанныхНаСервере();
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлПолученный);
	АдресФайла = Неопределено;

	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ОткрытьФайлДанныхЗавершение", ЭтотОбъект, Новый Структура("ДвоичныеДанные", ДвоичныеДанные)));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлДанныхЗавершение(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	ДвоичныеДанные = ДополнительныеПараметры.ДвоичныеДанные;

	АдресФайла = ИмяКаталогаВременныхФайлов + Объект.ФайлДанных;
	ДвоичныеДанные.Записать(АдресФайла);
	ЗапуститьПриложение(АдресФайла);

КонецПроцедуры

&НаСервере
Функция ОткрытьФайлДанныхНаСервере()
	
	АдресФайла = КаталогВременныхФайлов() + Объект.ФайлДанных;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные = ДокОбъект.ХранилищеФайла.получить();
	текФайл = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Возврат текФайл;
КонецФункции

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru='Для добавление файлов необходимо записать объект. Записать?'");
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьФайлЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ДобавитьФайлПроцедура();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлПроцедура()
    
    ИдентификаторФайла = Новый УникальныйИдентификатор;
     
    РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Записать();
    Иначе
        Возврат
    КонецЕсли;
    
    
    ДобавитьФайлПроцедура();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Файл" Тогда
		
		Модифицированность = Истина;
		Если ТипЗнч(Источник) = Тип("Массив") Тогда
			Для Каждого СтрокаФайла из Источник цикл
				НоваяСтрокаТЧ = Объект.ПрикрепленныеДокументы.Добавить(); 
				НоваяСтрокаТЧ.НаименованиеФайла = СтрокаФайла;				
			КонецЦикла;
		иначе
			НоваяСтрокаТЧ = Объект.ПрикрепленныеДокументы.Добавить(); 
			НоваяСтрокаТЧ.НаименованиеФайла = Источник;
		КонецЕсли;		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ПолученныйФайл = ПолучитьСтруктуруКлиент();
	РаботаСФайламиКлиент.ОткрытьФайл(ПолученныйФайл,Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруКлиент()
	
	ПолученныйФайл =  РаботаСФайламиКлиент.ДанныеФайла(Элементы.ПрикрепленныеДокументы.ТекущиеДанные.НаименованиеФайла,Объект.Ссылка.УникальныйИдентификатор());
	
	Возврат ПолученныйФайл;
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ПолученныйФайл = ПолучитьСтруктуруКлиент();

	РаботаСФайламиКлиент.СохранитьФайлКак(ПолученныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	УдалитьФайлСервер(Элементы.ПрикрепленныеДокументы.ТекущиеДанные.НаименованиеФайла);

	Объект.ПрикрепленныеДокументы.Удалить(Элементы.ПрикрепленныеДокументы.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлСервер(ФайлУдаления)
	
	ПолученныйФайл = ФайлУдаления.ПолучитьОбъект();
	ПолученныйФайл.Удалить();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
